# Дан список чисел. Определите сколько в нём встречается различных чисел.
list = [1, 2, 3, 10, 1, 7]
amount = len(set(list))
print(amount)