# Напишите программу для печати всех уникальных значений в словаре

dic = [{"V":"s1"},{"V":"s2"}, {"VI":"s1"}, {"VI":"s5"}, {"VII":"s5"}, {"V":"s9"}, {"VIII":"s7"}]
print(set(list( i.values())[0].strip() for i in dic))